src_ext/InformationRegisters/УЗ_НастройкиОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_НастройкиОплатыQR</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_НастройкиОплатыQR/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Запись.СрокМинут) И Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.СрокМинут = УЗ_ПровайдерыОплатQR.СрокПоУмолчанию();
	КонецЕсли;
	ОбновитьСостояние();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ОбновитьСостояние();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекстКассы = Справочники.УЗ_Кассы.ТекстКассаДругойОрганизации(ТекущийОбъект.Касса, ТекущийОбъект.Организация);
	Если Не ПустаяСтрока(ТекстКассы) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстКассы;
		Сообщение.Поле = "Запись.Касса";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//ключ — в отдельном регистре без прав у ролей (пишет общий модуль, только руководитель); поле очищается
	Если Не ПустаяСтрока(НовыйКлюч) Тогда
		УЗ_ОплатыQR.ЗаписатьКлюч(ТекущийОбъект.Организация, НовыйКлюч);
		НовыйКлюч = "";
	КонецЕсли;
	ОбновитьСостояние();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПровайдерПриИзменении(Элемент)

	ПровайдерПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПровайдерПриИзмененииНаСервере()

	ОбновитьПодсказки();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Готова ли организация принимать оплату по QR и что не так; ключ задан или нет (сам ключ в форму не передаётся).
&НаСервере
Процедура ОбновитьСостояние()

	Если ЗначениеЗаполнено(Запись.Организация) Тогда
		КлючЗадан = УЗ_ОплатыQR.КлючЗадан(Запись.Организация);
		Причина = УЗ_ОплатыQR.ПричинаНеготовности(Запись.Организация);
	Иначе
		КлючЗадан = Ложь;
		Причина = НСтр("ru = 'Выберите организацию и запишите настройки.'");
	КонецЕсли;
	Элементы.НовыйКлюч.ПодсказкаВвода = ?(КлючЗадан, НСтр("ru = 'сохранён'"), НСтр("ru = 'не задан'"));
	Элементы.Состояние.Заголовок = ?(ПустаяСтрока(Причина), НСтр("ru = 'Готово: менеджер может выставлять QR.'"),
		НСтр("ru = 'Не готово:'") + " " + Причина);
	ОбновитьПодсказки();

КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказки()

	Точка = УЗ_ПровайдерыОплатQR.НуженСчет(Запись.Провайдер);
	Элементы.НомерСчета.Видимость = Точка;
	Элементы.Логин.ПодсказкаВвода = ?(Точка, "merchantId (MF0000000001)", "TerminalKey");

КонецПроцедуры

#КонецОбласти
